Repository: fadyZaherEng/Portfolio
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Select Date
ar: اختار التاريخ

source: Done
ar: تم

source: Cancel
ar: الغاء

source: Select Language
ar: أخنار اللغه

source: Try Again
ar: حاول مره اخرى

source: Video
ar: فيديو

source: Search
ar: بحث

# appTitle
source: My Portfolio
ar: ملفي الشخصي

# menuHeader
source: Menu
ar: القائمة

source: Home
ar: الرئيسية

source: Skills
ar: المهارات

source: Experience
ar: الخبرة

source: Portfolio
ar: مشاريعي

source: Contact
ar: اتصل

source: Dark Mode
ar: الوضع الليلي

source: What Can I Do?
ar: ماذا يمكنني ان افعل؟

# welcomeMessage
source: Hello, Welcome to My Portfolio
ar: مرحبًا، أهلا بك في ملفي الشخصي!

# imFady
source: I'm Fady Zaher, A Software Engineer
ar: أنا فادي زاهر، مهندس برمجيات

source: VIEW RESUME
ar: عرض السيرة الذاتية

source: Dashboard
ar: لوحة التحكم

source: ANDROID APP
ar: أندرويد أبليكشن

source: IOS APP
ar: أيفون ابليكشن

source: WEB APP
ar: ويب ابليكشن

# offer
source: I offer tailored Flutter development services, specializing in building intuitive, high-performance mobile apps and websites with clean architecture, ensuring seamless user experiences and efficient solutions for your business needs.
ar: أقدم خدمات تطوير Flutter المخصصة، وأتخصص في بناء تطبيقات ومواقع ويب متنقلة بواجهة بديهية وأداء عالٍ بهندسة نظيفة، مما يضمن تجارب مستخدم سلسة وحلولًا فعالة لتلبية احتياجات عملك.

# flutterTitle
source: Flutter Development for Android | iOS | Web
ar: تطوير Flutter لنظام Android | iOS | الويب

# flutterDescription
source: Passionate about building responsive, scalable cross-platform apps.
ar: شغوف ببناء تطبيقات متجاوبة وقابلة للتوسع عبر الأنظمة الأساسية.

source: Flutter
ar: فلاتر

source: Dart
ar: دارت

source: Firebase
ar: فايربيس

source: Responsive UI and Performance
ar: واجهة مستخدم متجاوبة وأداء عالي

source: Clean Architecture
ar: الهندسة النظيفة

source: API Integration
ar: تكامل API

source: Continuous Integration
ar: التكامل المستمر

# stateManagementTitle
source: State Management
ar: إدارة الحالة

# stateManagementDescription
source: Efficiently manage app state using Flutter's state management solutions.
ar: إدارة حالة التطبيق بكفاءة باستخدام حلول Flutter لإدارة الحالة.

source: Bloc
ar: بلوك

source: Riverpod
ar: ريفر بود

source: GetX
ar: جيت إكس

source: Provider
ar: بروفايدر

# cleanArchitectureTitle
source: Clean Architecture
ar: الهندسة النظيفة

# cleanArchitectureDescription
source: Implement clean architecture patterns for maintainable and testable code.
ar: تطبيق أنماط الهندسة النظيفة لضمان كود قابل للصيانة والاختبار.

source: MVVM Architecture
ar: هندسة MVVM

# webDevelopmentTitle
source: Web Development
ar: تطوير الويب

# webDevelopmentDescription
source: Proficient in HTML, CSS, JavaScript, and other web technologies for building dynamic and interactive web applications.
ar: متقن في HTML و CSS و JavaScript والتقنيات الأخرى لتطوير تطبيقات ويب تفاعلية وديناميكية.

source: HTML
ar: إتش تي إم إل

source: CSS
ar: سي إس إس

source: JavaScript
ar: جافا سكريبت

source: C#
ar: سي شارب

source: .NetMvc
ar: .نت MVC

# apiIntegrationTitle
source: API Integration
ar: تكامل API

# apiIntegrationDescription
source: Integrate with APIs to fetch data and interact with external services.
ar: الاندماج مع واجهات برمجة التطبيقات لجلب البيانات والتفاعل مع الخدمات الخارجية.

source: Dio
ar: ديو

source: Retrofit
ar: ريتروفِت

source: HTTP
ar: إتش تي تي بي

source: Mockito
ar: موكيتو

source: Socket
ar: سوكت

# responsiveUITitle
source: Responsive UI
ar: واجهة مستخدم متجاوبة

# responsiveUIDescription
source: Design responsive and user-friendly interfaces for a consistent user experience across different screen sizes and devices.
ar: تصميم واجهات متجاوبة وسهلة الاستخدام لضمان تجربة مستخدم متسقة عبر مختلف الأجهزة وأحجام الشاشات.

source: Responsive
ar: متجاوب

source: Adaptive
ar: تكيفي

source: Adaptive UI
ar: واجهة مستخدم تكيفية

# performanceOptimizationTitle
source: Performance Optimization
ar: تحسين الأداء

# performanceOptimizationDescription
source: Optimize app performance to ensure smooth user interactions and smooth navigation.
ar: تحسين أداء التطبيق لضمان تفاعلات سلسة وتنقل مرن.

source: Optimization
ar: تحسين

source: Performance
ar: الأداء

source: Memory Management
ar: إدارة الذاكرة

# testingAndDebuggingTitle
source: Testing and Debugging
ar: الاختبار وإصلاح الأخطاء

# testingAndDebuggingDescription
source: Perform unit and integration testing to ensure code quality and stability.
ar: إجراء اختبارات الوحدة والتكامل لضمان جودة واستقرار الكود.

source: Testing
ar: الاختبار

source: Debugging
ar: إصلاح الأخطاء

source: Unit Testing
ar: اختبار الوحدة

source: Integration Testing
ar: اختبار التكامل

source: Performance Testing
ar: اختبار الأداء

source: Security Testing
ar: اختبار الأمان

# continuousIntegrationTitle
source: Continuous Integration
ar: التكامل المستمر

# continuousIntegrationDescription
source: Implement continuous integration and deployment pipelines for automated builds and deployments.
ar: تنفيذ خطوط تكامل ونشر مستمر لأتمتة عمليات البناء والتوزيع.

source: Jenkins
ar: جينكينز

source: Git
ar: جيت

source: GitHub
ar: جيت هاب

source: GitHub Actions
ar: إجراءات جيت هاب

source: Bitbucket
ar: بت باكت

source: Bitbucket Pipeline
ar: بت باكت بايبلاين

# localDataStorageAndOfflineSupportTitle
source: Local Data Storage and Offline Support
ar: تخزين البيانات محليًا ودعم العمل دون اتصال

# localDataStorageAndOfflineSupportDescription
source: Implement local data storage and provide offline support for your app.
ar: تنفيذ تخزين البيانات محليًا وتوفير دعم للعمل دون اتصال في التطبيق.

source: Hive
ar: هايف

source: SQFLite
ar: إس كيو إف لايت

source: Shared Preferences
ar: التفضيلات المشتركة

source: Flutter Secure Storage
ar: تخزين فلاتر الآمن

# pushNotificationsTitle
source: Push Notifications
ar: الإشعارات الفورية

# pushNotificationsDescription
source: Implement push notifications to provide real-time updates and notifications to your app's users.
ar: تنفيذ الإشعارات الفورية لتقديم تحديثات وإشعارات في الوقت الفعلي لمستخدمي التطبيق.

source: Flutter Local Notifications Plugin
ar: إضافة الإشعارات المحلية لفلاتر

source: Firebase Messaging
ar: مراسلة فايربيس

source: Flutter Notification
ar: إشعارات فلاتر

# geolocationAndMapsIntegrationTitle
source: Geolocation and Maps Integration
ar: تكامل تحديد الموقع والخرائط

# geolocationAndMapsIntegrationDescription
source: Implement geolocation and maps integration for your app.
ar: تنفيذ تكامل تحديد المواقع والخرائط في التطبيق.

source: Maps
ar: خرائط

source: Google Maps
ar: خرائط جوجل

source: Google Maps API
ar: واجهة برمجة خرائط جوجل

source: Google Maps Plugin
ar: إضافة خرائط جوجل

source: Location Tracking
ar: تتبع الموقع

# softwareDevelopmentConceptsTitle
source: Software Development Concepts
ar: مفاهيم تطوير البرمجيات

# softwareDevelopmentConceptsDescription
source: Understand the core concepts of software development and design patterns.
ar: فهم المفاهيم الأساسية لتطوير البرمجيات وأنماط التصميم.

source: Design Patterns
ar: أنماط التصميم

source: Object-Oriented Programming
ar: البرمجة الكائنية

source: Data Structures
ar: هياكل البيانات

source: Algorithms
ar: الخوارزميات

source: Problem Solving
ar: حل المشكلات

# developmentToolsAndVersionControlTitle
source: Development Tools and Version Control
ar: أدوات التطوير وإدارة الإصدارات

# developmentToolsAndVersionControlDescription
source: Choose the right development tools and version control system for your project.
ar: اختيار أدوات التطوير ونظام التحكم في الإصدارات المناسب للمشروع.

source: Android Studio
ar: أندرويد ستوديو

source: Visual Studio
ar: فيجوال ستوديو

# intellij
source: IntelliJ IDEA
ar: إنتيليجاي

# gitVersionControl
source: Git
ar: جيت

# githubVersionControl
source: GitHub
ar: جيت هاب

# bitbucketVersionControl
source: Bitbucket
ar: بت باكت

# gitlabVersionControl
source: GitLab
ar: جيت لاب

# databaseTechnologiesTitle
source: Database Technologies
ar: تقنيات قواعد البيانات

# databaseTechnologiesDescription
source: Implement database technologies for efficient and reliable data storage.
ar: تنفيذ تقنيات قواعد البيانات لتخزين البيانات بكفاءة وموثوقية.

source: SqLite
ar: إس كيو لايت

source: MySQL
ar: ماي إس كيو إل

source: SQL Database
ar: قاعدة بيانات SQL

# additionalSkillsTitle
source: Additional Skills
ar: مهارات إضافية

# additionalSkillsDescription
source: Acquire additional skills and expertise to enhance your development capabilities.
ar: اكتساب مهارات وخبرات إضافية لتعزيز قدرات التطوير لديك.

source: Python
ar: بايثون

source: Java
ar: جافا

source: Kotlin
ar: كوتلن

source: C Plus Plus
ar: سي بلس بلس

source: C Sharp
ar: سي شارب

# chaptersStory
source: I'm Fady Zaher, a passionate Flutter Developer and Designer with a proven track record of creating beautiful, responsive, and interactive apps that focus on performance and user experience, bringing your ideas to life. With a strong background in design and a deep understanding of user experience, I am committed to delivering exceptional results that exceed expectations while staying up-to-date with the latest Flutter trends and technologies. I’m a Mid-Level Software Engineer, passionate about mobile development , looking for work as a Flutter Software Engineer to gain real experience and assist the organization in achieving its goals. If you're looking for a skilled Flutter Developer to take your app to the next level, let's collaborate and turn your vision into reality!
ar: أنا فادي زاهر، مطور ومصمم Flutter شغوف يتمتع بسجل حافل في إنشاء تطبيقات جميلة وتفاعلية ومستجيبة تركز على الأداء وتجربة المستخدم، وتحويل أفكارك إلى واقع. بفضل خلفيتي القوية في التصميم وفهمي العميق لتجربة المستخدم، ألتزم بتقديم نتائج استثنائية تفوق التوقعات مع مواكبة أحدث اتجاهات وتقنيات Flutter. أنا مهندس برمجيات متوسط المستوى شغوف بتطوير تطبيقات الهواتف المحمولة ، وأبحث عن فرصة عمل كمطور Flutter لاكتساب خبرة عملية حقيقية والمساهمة في تحقيق أهداف المنظمة. إذا كنت تبحث عن مطور Flutter ماهر لنقل تطبيقك إلى المستوى التالي، دعنا نتعاون ونحول رؤيتك إلى واقع!

# myChapter
source: Chapters Of My Career
ar: فصول من مسيرتي المهنية

# moreThanYearsExperienceAsA
source: ‎‎+ 2 Years Experience As A
ar: مع خبرة 2 + سنة في

source: Flutter Developer
ar: مطور Flutter

source: Mid Level Software Engineer
ar: مهندس برمجيات متوسط المستوى

source: Software Engineer
ar: مهندس برمجيات

source: Mid Level Flutter Software Engineer
ar: مهندس برمجيات Flutter متوسط المستوى

source: Mobile Software Engineer
ar: مهندس برمجيات هاتف محمول

source: Mobile App Development Intern
ar: متدرب تطوير تطبيقات الهاتف المحمول

# mobileSoftwareEngineerFreelancer
source: Freelancer Mobile Software Engineer
ar: مهندس برمجيات هاتف محمول مستقل

source: My Projects
ar: مشاريعي

# exploreMyProjects
source: Explore My Projects that showcase my skills and expertise in Flutter development.where I have successfully delivered innovative and user-friendly apps that meet the highest standards of performance and user experience.
ar: استكشف مشاريعي التي تُبرز مهاراتي وخبرتي في تطوير Flutter، حيث قمت بتقديم تطبيقات مبتكرة وسهلة الاستخدام تلبي أعلى معايير الأداء وتجربة المستخدم.

source: Open Link
ar: افتح الرابط

source: About Me
ar: حولي

# aboutMeDescription
source: I’m Mid Level Software Engineer, passionate about mobile development with ‎+ 2 Years of Experience, looking for work as Flutter Software Engineer to gain real experience and assist the organization to achieve their goals
ar: أنا مهندس برمجيات متوسط المستوى، شغوف بتطوير تطبيقات الهاتف المحمول مع 2 + سنوات من الخبرة، أبحث عن عمل كمهندس برمجيات Flutter لاكتساب خبرة حقيقية والمساهمة في تحقيق أهداف المؤسسة.

source: Education
ar: التعليم

# university
source: Bachelor of computer and information science | Ain Shams University
ar: بكالوريوس في علوم الحاسوب والمعلومات | جامعة عين شامس

# universityDescription
source: Graduation Project Body Language and emotion recognition website (Django-python)
ar: مشروع تخرجي لموقع تحديد اللغة الجسمية والتعلم من الاحساسات (Django-python)

# universityDegree
source: Excellent Graduation Project || Very Good (3.3 GPA) Cumulative Score
ar: مشروع تخرجي ممتاز || جيد جدا (3.3 GPA) || نتيجة جمعية

source: Ain Shams University
ar: جامعة عين شمس

# letsCreateSomethingAmazing
source: Let's Create Something Amazing Together!
ar: ابدا بانشاء شيء جميل

# feelFreeToContactMe
source: Feel free to reach out if you'd like to discuss a project, a job opportunity, or simply want to connect.
ar: يمكنك معرفة المزيد عني والتواصل معي عبر الرابط التالي

source: CONTACT ME
ar: اتصل بي

source: Training
ar: تدريب

source: VIEW RESUME
ar: عرض السيرة الذاتية

source: Failed to launch WhatsApp
ar: فشل في تشغيل WhatsApp

source: Facebook
ar: فيسبوك

source: Linkedin
ar: لينكدان

source: YouTube
ar: يوتيوب

source: Skills Offer
ar: مهاراتي المتوفرة
